research.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="" xml:lang="">
<head>
<!-- 2021-11-29 Mon 13:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Jin-Cheng Guu</title>
<meta name="author" content="Jin" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="./style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Jin-Cheng Guu</h1>
<p>
<a href="./index.html">Home</a> | <a href="./research.html">Research</a> | <a href="./teaching.html">Teaching</a>
</p>

<div id="outline-container-org4ba1721" class="outline-2">
<h2 id="org4ba1721">Research</h2>
<div class="outline-text-2" id="text-org4ba1721">
</div>
<div id="outline-container-org2033ab4" class="outline-3">
<h3 id="org2033ab4">Publications</h3>
<div class="outline-text-3" id="text-org2033ab4">
<ul class="org-ul">
<li><a href="https://arxiv.org/abs/2107.05914">Categorical Center of Higher Genera and 4D Factorization
Homology</a>, (preprint) arXiv:2107.05914</li>

<li><a href="https://arxiv.org/abs/2111.06919">Explicit Factorization of a Categorical Center</a> (joint with Ying
Hong Tham), (preprint) arXiv:2111.06919</li>

<li>4D Shadow State Sum Invariant, (preprint) to appear.</li>
</ul>
</div>
</div>

<div id="outline-container-org5e8598c" class="outline-3">
<h3 id="org5e8598c">Description</h3>
<div class="outline-text-3" id="text-org5e8598c">
<ul class="org-ul">
<li><p>
<b>Crane-Yetter theory in dimension two</b>
</p>

<p>
Crane-Yetter theory (a state-sum model parallel to Walker-Wang
model) is a fully extended TQFT. However, not until 2019 was
its categorical aspect investigated. In my work, I proved the
Crane-Yetter theory for all open surfaces are equivalent to a
type of explicitly constructed category, namely the categorical
centers of higher genera.
</p></li>

<li><p>
<b>(q,t) -deformation of knot amplitudes</b>
</p>

<p>
Quantum 6j-symbols are numerical presentations of the monoidal
structures for the quantum group Rep(U<sub>q</sub>(g)). Their squares seem
to admit (q,t)-deformations by the numerical evidence
discovered by Shamil Shakirov and Semeon Arthamonov. We aim to
find a theoretic basis for such (q,t)-deformation.
</p></li>

<li><p>
<b>Matrix-valued symmetric Macdonald polynomials</b>
</p>

<p>
Alexander Kirillov and Pavel Etingof found a link between
Macdonald symmetric polynomials and the generalized traces of
(special) representations of quantum groups (type A) in the
90s. It is natural to consider all representations instead, and
ask for the properties of the corresponding matrix-valued
symmetric polynomials.
</p></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jin</p>
<p class="email">Email: <a href="mailto:jin-cheng.guu@stonybrook.edu">jin-cheng.guu@stonybrook.edu</a></p>
<p class="date">Created: 2021-11-29 Mon 13:25</p>
</div>
</body>
</html>
